Proj_Mgt_ORG_Outline/Proj_Mgt.tex
% Created 2016-09-27 Tue 19:03
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\setcounter{secnumdepth}{5}
\author{Luke M Perez}
\date{\today}
\title{Project Management for Grad Students: a brief guide}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.5.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle

\section{Introduction}
\label{sec-1}
What does writing a paper share in common with cooking and war?
Answer: each has an pre-visualized end-state that requires multiple,
independent dependencies, each with their own time-lines.

\subsection{Open loops and anxiety}
\label{sec-1-1}
A good project management system is mostly about managing the anxiety
about open loops in your mind. \sidenote{David Allen, GTD}
\subsection{Process over Apps}
\label{sec-1-2}
Over the years I've used a variety of task management applications and
"systems" to greater and lesser degrees of failure and success. I'll
keep my remarks platform and application agnostic, offering comments
on what I use at the end.
\subsection{Advanced Common sense}
\label{sec-1-3}
Most of what I will cover is best described as "advanced common
sense". I hope to say nothing you've not already heard before but
perhaps in a new and interesting way.
\section{The process}
\label{sec-2}
\subsection{Reverse (backward) planning.}
\label{sec-2-1}
\begin{enumerate}
\item Dependency driven
\label{sec-2-1-1}
\item Deadline driven
\label{sec-2-1-2}
\item Context driven
\label{sec-2-1-3}
\end{enumerate}
\subsection{Projects, Tasks, Contexts}
\label{sec-2-2}
\begin{enumerate}
\item GTD crash course
\label{sec-2-2-1}
\item A sample project
\label{sec-2-2-2}
\end{enumerate}
\section{The Apps}
\label{sec-3}
\subsection{Currently using}
\label{sec-3-1}
\begin{enumerate}
\item Emacs
\item DevonThink
\item OmniFocus
\item NvALT
\item markdown+pandoc
\end{enumerate}
\subsection{Previously used}
\label{sec-3-2}
\begin{enumerate}
\item Sublime Text
\item Scrivener
\item Pages/Sente
\end{enumerate}
\subsection{Shoulda, Coulda, Woulda}
\label{sec-3-3}
\begin{enumerate}
\item Mendeley
\item Index Cards
\end{enumerate}




\section{The problem}
\label{sec-4}
\subsection{Time and attention}
\label{sec-4-1}
\begin{enumerate}
\item Finite Resources
\label{sec-4-1-1}
\item Infinite demands
\label{sec-4-1-2}
\end{enumerate}
\subsection{For example}
\label{sec-4-2}
\begin{enumerate}
\item Think about the raw numbers of a work day
\begin{enumerate}
\item 3 hours of seminar, 1--2 hours of grading or TA class, reading
ungodly amounts of literature for class, stats problem sets, etc.
\item An hour for the gym, lunch and coffee breaks, commute time
to/from campus.
\item Spending time with Significant Other, calling home, Netflix and chill
\end{enumerate}
\item Where is the the time to get things done?
\begin{enumerate}
\item Again, we're back to managing the anxiety
\item And if we've captured our stuff adequately, we'll know where to
start.
\end{enumerate}
\end{enumerate}
\subsection{Projects, is and ought}
\label{sec-4-3}
\begin{enumerate}
\item How it is, forwardly linear
\label{sec-4-3-1}

pick a topic → find some articles → read about it → get some data →
since the deadline isn't for a while, tinker with the data, maybe read
some more and \ldots{} → Whollyshit it's due tomorrow write like crazy

\item A better way, reverse dependencies
\label{sec-4-3-2}

Write up theory/litt review section ← Data analysis ← Write data
section ← complete  draft two weeks prior to deadline ← Reverse Outline ← Revise ← Proof read ← Deadline
\end{enumerate}

\section{A GTD Crash Course}
\label{sec-5}
\subsection{Projects, Tasks, Contexts}
\label{sec-5-1}
\begin{enumerate}
\item Projects vs. Tasks
\label{sec-5-1-1}
\begin{enumerate}
\item A task is any single action
\begin{enumerate}
\item e.g., email adviser about grading for TA class
\end{enumerate}
\item A project is any objective that requires two or more tasks to complete
\begin{enumerate}
\item e.g., Attend office hours for adviser
\begin{enumerate}
\item Figure out when his or her office hours are this semester
\item Create agenda
\item email agenda
\item Review agenda and prep for discussion
\end{enumerate}
\end{enumerate}
\end{enumerate}
\item Tasks vs Contexts
\label{sec-5-1-2}
\begin{enumerate}
\item Every task should be long to a project and context
\item A context is the thing that must be present for you to accomplish
the task
\begin{enumerate}
\item e.g., You're telephone to make a phone call
\item Your laptop to write a paper
\item Amazon
\item Grocery store
\end{enumerate}
\item Sometimes contexts can be things other than physical objects
\begin{enumerate}
\item Make a context for each major faculty member you interact with regularly
\item Time of day or energy level (e.g., morning vs evening writers)
\end{enumerate}
\end{enumerate}
\end{enumerate}
\subsection{The Point of all this}
\label{sec-5-2}
\begin{enumerate}
\item Break down as much as you can into tasks and projects.
\item Review those regularly, a quick morning review and a longer weekly review
\item It takes time before your mind lets go of the anxiety so be patient
\item In fact, start small with a simple, straight forward system, on a
handful of the most important things you don't want to get behind
on; then start to include more things
\end{enumerate}
\section{Inbox Zero}
\label{sec-6}
\subsection{GTD is about planning. What about execution?}
\label{sec-6-1}

\subsection{Five actions of Inbox Zero (Merlin Mann)}
\label{sec-6-2}
\begin{enumerate}
\item Delete (or archive)
\item Delegate
\item Respond
\item Defer
\item Do
\end{enumerate}
\section{Putting it together}
\label{sec-7}
\section{Some applications}
\label{sec-8}
DevonThink (database)
OmniFocus (tasks)
NvAlt (notes and capture)
% Emacs 24.5.1 (Org mode 8.2.10)
\end{document}